---
kind: type
id: T:Autodesk.Revit.DB.ToposolidType
source: html/b7aa65b6-149a-c4ea-afc4-6714cd1a55f7.htm
---
# Autodesk.Revit.DB.ToposolidType

An object that specifies the type of a Toposolid in Autodesk Revit.

## Syntax (C#)
```csharp
public class ToposolidType : HostObjAttributes
```